honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1459x/toolbox_resources/common/DA1459x-00.xml
- map bandgap_enable to P0_11
- map (wokenup OR cmac_slp_timer_expire) to P1_02</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>COM_SLEEP</name>
	<description>Put the Communications powerdomain (PD_COM) in powerdown </description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_SLEEP</name>
	<description>Put the Timers Powerdomain (PD_TIM) in powerdown.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIO_SLEEP</name>
	<description>Put the digital part of the radio, including CMAC (PD_RAD) in powerdown </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PERIPH_SLEEP</name>
	<description>Put the peripherals power domain (PD_PER) in powerdown</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PMU_SLEEP_REG</name>
	<description>Configures the sleep/wake-up strategy</description>
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00002080</resetValue>
	<resetMask>0x0001ffff</resetMask>
	<fields><field>
	<name>FAST_WAKEUP</name>
	<description>Speeds up the wake-up process by enabling all LDOs simultaneously instead of in staggered order. Only use if all voltages have been retained during sleep.</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_OK_BYPASS</name>
	<description>Don't wait for LDO_OK signals in the wake-up process from sleep mode, but use a fixed timeout of 32 us.
The BOD comparator check will make sure the supplies are OK before going to active state. </description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FAST_WAKEUP_SKIP_BGR_OK</name>
	<description>Go to running mode immediately, do not wait for the BGR_OK signal after a fast_wakeup trigger</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_MASK_BGR_OK</name>
	<description>MASK BOD reset when BGR is NOK</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BG_ENABLE_SLEEP</name>
	<description>Keep the bandgap enabled during deep sleep operation</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BG_REFRESH_INTERVAL</name>
	<description>This is a value defining the interval every which the Bandgap will be activated for refresh. The value represents ticks of lp_clk/64, for example, 30,5 us * 64 = 1,9 ms.</description>
	<bitRange>[11:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>POR_PIN_REG</name>
	<description>Selects a GPIO pin for POR generation</description>
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000003f</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>POR_PIN_POLARITY</name>
	<description>0: Active Low
1: Active High
Note: This applies only for the GPIO pin. Reset pad is always active High</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>POR_PIN_SELECT</name>
	<description>0x00: P0_00
...
0x0F: P0_15
0x10: P1_00
...
0x1F: P1_15
0x20 to 0x3E: reserved
0x3F: POR generation disabled</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>POR_TIMER_REG</name>
	<description>Time for POR to happen</description>
	<addressOffset>0x0000009c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000018</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>POR_TIME</name>
	<description>Time for the POReset to happen.
Formula:
Time = POR_TIME x 4096 x RC32 clock period
Default value: ~3 seconds</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>POWER_CTRL_REG</name>
	<description>Power control register</description>
	<addressOffset>0x000000e0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00006517</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>LDO_CORE_RET_VREF_ENABLE</name>
	<description>Enable the LDO_CORE_RET VREF buffer in the bandgap. </description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_IO_RET_VREF_ENABLE</name>
	<description>Enable the LDO_IO_RET VREF buffer in the bandgap</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_VREF_HOLD_FORCE</name>
	<description>Forces LDO references in hold mode</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCDC_ENABLE_SLEEP</name>
	<description>Enable the DCDC in sleep mode when DCDC_ENABLE is also set in DCDC_CTRL_REG</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_CORE_RET_ENABLE_SLEEP</name>
	<description>Enables (1) or disables (0) LDO_CORE_RET in sleep mode</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_CORE_RET_ENABLE_ACTIVE</name>
	<description>Enables (1) or disables (0) LDO_CORE_RET in active mode</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_LOW_ENABLE_SLEEP</name>
	<description>Enable the LDO_LOW in sleep mode</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_LOW_HIGH_CURRENT</name>
	<description>Force high current mode for LDO_LOW</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_IO_BYPASS_SLEEP</name>
	<description>Enables the LDO_IO bypass in sleep mode. Note that, when this bit is asserted, it overrules the regulating operation of the LDO</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_IO_BYPASS_ACTIVE</name>
	<description>Enables the LDO_IO bypass in active mode. Note that, when this bit is asserted, it overrules the regulating operation of the LDO</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_IO_RET_ENABLE_SLEEP</name>
	<description>Enables (1) or Disables (0) LDO_IO_RET in sleep mode</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_IO_RET_ENABLE_ACTIVE</name>
	<description>Enables (1) or Disables (0) LDO_IO_RET in active mode</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_CORE_ENABLE</name>
	<description>Enables the LDO_CORE (0) Disable (1) Enable</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_LOW_ENABLE_ACTIVE</name>
	<description>Enables the LDO_LOW (0) Disable (1) Enable</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_IO_ENABLE</name>
	<description>Enables the LDO_IO... (0) Disable (1) Enable</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>POWER_LEVEL_REG</name>
	<description>Power level settings</description>
	<addressOffset>0x000000e4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001800</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>XTAL32M_LDO_LEVEL</name>
	<description>Set the Level of the Xtal LDO.
0x0 = 882 mV
0x1 = 888 mV
0x2 = 894 mV
0x3 = 900 mV
0x4 = 906 mV
0x5 = 912 mV
0x6 = 918 mV
0x7 = 924 mV</description>
	<bitRange>[13:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VDDIO_TRIM</name>
	<description>Set the VDDIO level (25 mV/LSB):
0x8: 1.6 V
0x9: 1.625 V
...
0xF: 1.775 V
0x0: 1.8 V
0x1: 1.825 V
...
0x7: 1.975 V</description>
	<bitRange>[10:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VDCDC_LEVEL</name>
	<description>Set the VDCDC level, 0x0 = 1.1 V, 0x7 = 1.45 V, step = 50 mV</description>
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VDD_LEVEL_SLEEP</name>
	<description>Set the VDD level in sleep mode. 0x0 = 0.75 V, 0x1 = 0.9 V</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VDD_LEVEL_ACTIVE</name>
	<description>Level setting for VDD rail
0x0: 0.9 V , 0x7 = 1.25 V
50 mV steps</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RAM_PWR_CTRL_REG</name>
	<description>Control power state of System RAMS</description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>RAM3_PWR_CTRL</name>
	<description>See description of RAM1_PWR_CTRL.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM2_PWR_CTRL</name>
	<description>See description of RAM1_PWR_CTRL.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM1_PWR_CTRL</name>
	<description>Power state control of the individual RAMs. May only change when the memory isn't accessed.
When PD_MEM_IS_UP:
0x0: Normal operation
0x1: Normal operation
0x2: Retained (no access possible)
0x3: Off (memory content corrupted)
When PD_MEM_IS_DOWN:
0x0: Retained
0x1: Off (memory content corrupted)
0x2: Retained
0x3: Off (memory content corrupted)</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RESET_STAT_REG</name>
	<description>Reset status register</description>
	<addressOffset>0x000000bc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000003f</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>CMAC_WDOGRESET_STAT</name>
	<description>Indicates that a CMAC-Watchdog timeout has happened. Note that it is also set when a POReset has happened.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SWD_HWRESET_STAT</name>
	<description>Indicates that a write to SWD_RESET_REG has happened. Note that it is also set when a POReset has happened.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WDOGRESET_STAT</name>
	<description>Indicates that a Watchdog timeout has happened. Note that it is also set when a POReset has happened.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SWRESET_STAT</name>
	<description>Indicates that a software reset has happened</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HWRESET_STAT</name>
	<description>Indicates that a hardware reset has happened</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PORESET_STAT</name>
	<description>Indicates that a PowerOn Reset has happened.
All bitfields of RESET_STAT_REG should be read (to check the source of reset) and then cleared to 0, allowing thus the hardware to automatically set to 1 the proper bitfields during the next reset event.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RST_CTRL_REG</name>
	<description>Reset control register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>CMAC_CACHE_FLUSH_WITH_SW_RESET</name>
	<description>0: Flush the CMAC Cache memory only at hardware reset.
1: Flush the CMAC Cache memory also at software reset.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS_CACHE_FLUSH_WITH_SW_RESET</name>
	<description>0: Flush the System Cache memory only at hardware reset.
1: Flush the System Cache memory also at software reset.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GATE_RST_WITH_FCU</name>
	<description>0: Reset is not gated with FCU write/erase
1: Reset delayed in case FCU write/erase is ongoing. Software reset is never gated so should not be set during FCU write/erase.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SECURE_BOOT_REG</name>
	<description>Controls secure booting (only ROM software can write)</description>
	<addressOffset>0x000000cc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>PROT_INFO_PAGE</name>
	<description>Protection of eFlash info page
0: Write/erase of info page enabled
1: Write/erase of info page permanently disabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>SECURE_BOOT</name>
	<description>Follows the respective eFlash flag value
0: System is not supporting secure boot
1: System is a secure system supporting secure boot</description>
	<bitRange>[6:6]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>FORCE_CMAC_DEBUGGER_OFF</name>
	<description>This bit will permanently disable the CMAC debugger</description>
	<bitRange>[5:5]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>FORCE_M33_DEBUGGER_OFF</name>
	<description>This bit will permanently disable the M33 debugger</description>
	<bitRange>[4:4]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>PROT_USER_APP_CODE</name>
	<description>This bit will permanently disable write/erase of user application code sector</description>
	<bitRange>[3:3]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>PROT_VALID_KEY</name>
	<description>This bit will permanently disable read/erase of validation keys sector</description>
	<bitRange>[2:2]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>PROT_APP_KEY</name>
	<description>This bit will permanently disable read/erase of application keys sector</description>
	<bitRange>[1:1]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>PROT_CONFIG_SCRIPT</name>
	<description>This bit will permanently disable write/erase of configuration script sector</description>
	<bitRange>[0:0]</bitRange>
	<access>read-writeOnce</access>
	</field></fields>
</register><register>
	<name>STARTUP_STATUS_REG</name>
	<description>Startup Statemachine Status Register</description>
	<addressOffset>0x000000fc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000fffff</resetMask>
	<fields><field>
	<name>VEFLASH_LVL_RD</name>
	<description>Read back the Eflash level setting. </description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VEFLASH_OK_SYNC</name>
	<description>Read back the synchronized signal from the veflash comparator.It will become 0x1 when the VDD &gt;1.08 V.This bit does not inform of a BOD event</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VDDIO_OK_SYNC_RD</name>
	<description>Read back the synchronized signal from the vdcdc bod comparator</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VDDD_OK_SYNC_RD</name>
	<description>Read back the synchronized signal from the vddd bod comparator</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VDCDC_OK_SYNC_RD</name>
	<description>Read back the synchronized signal from the vdcdc bod comparator</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VDDD_LVL_RD</name>
	<description>Read back bod_vddd_lvl setting. </description>
	<bitRange>[4:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VDDIO_MASK_SYNC_RD</name>
	<description>Synchronized bod_vddio_mask bit.
Can be used to check if mask bit has been set</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VDDD_MASK_SYNC_RD</name>
	<description>Synchronized bod_vddd_mask bit.
Can be used to check if mask bit has been set</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VDCDC_MASK_SYNC_RD</name>
	<description>Synchronized bod_vdcdc_mask bit.
Can be used to check if mask bit has been set</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>SYS_CTRL_REG</name>
	<description>System Control register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000020</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SW_RESET</name>
	<description>Writing 1 to this bit will generate a SW_RESET.</description>
	<bitRange>[15:15]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CACHERAM_MUX</name>
	<description>Controls accessibility of Cache RAM (incl. enabling/disabling of the Cache Controller):
0: The cache controller is disabled/bypassed, the cacheRAM is visible in the memory space,
1: The cache controller is enabled, the cacheRAM is not visible anymore in the memory space.
Note: When the cache controller is enabled after or at reset, the Cache is first initialized (cleared/flushed) by writing all 0s to each line, one line per clock cycle to all SRAM modules.
When the cache controller is disabled/bypassed the cache memory is cleared/flushed in the same way as during the first after reset initialization.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEBUGGER_ENABLE</name>
	<description>Enable the debugger. This bit is set by the booter according to the OTP header. If not set, the SWDIO and SW_CLK can be used as gpio ports. </description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>REMAP_INTVECT</name>
	<description>0: Normal operation
1: If ARM is in address range 0 to 0x1FF then the address is remapped to SYS-RAM 0x0080.0000 to 0x0080.01FF. This allows to put the interrupt vector table to be placed in RAM while executing, for example, from QSPI.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>REMAP_ADR0</name>
	<description>Controls which memory is located at address 0x0000 for execution.
0x0: ROM
0x1: eFlash
Note 1: When REMAP_ADR0 = 0x1, address 0x0 is mapped to EFLASH_REGION_BASE + EFLASH_REGION_OFFSET&lt;&lt;2
Note 2: When REMAP_ADR0 = 0x1, the CPU can only access the eFlash region [EFLASH_REGION_BASE + EFLASH_REGION_OFFSET&lt;&lt;2, EFLASH_REGION_SIZE] from the 0x00A00000 address range. The complete eFlash can be accessed via the 0x31000000 address range but only uncached.0x2: QSPI FLASH cached (see also the CACHE_FLASH_REG.FLASH_REGION.* descriptions)
Note 1: When REMAP_ADR0=0x2, address 0x0 is mapped to FLASH_REGION_BASE + FLASH_REGION_OFFSET&lt;&lt;2.
Note 2: When REMAP_ADR0=0x2, the CPU can only access the Flash region [FLASH_REGION_BASE + FLASH_REGION_OFFSET&lt;&lt;2, FLASH_REGION_SIZE] from the 0x16000000 address range. The complete Flash can be accessed via the 0x32000000 address range but only uncached. 0x3: SYSRAMS un-cached
0x4: SYSRAM3 (for testing purposes only)
0x5: System Cache Data RAM un-cached (CACHERAM_MUX = 0)
Note 1: DWord (64 bits) access is not supported by the Cache Data RAM interface in mirrored mode (only 32, 16 and 8 bits).
Note 2: DMA access is not supported by the Cache Data RAM interface when REMAP_ADR0 = 0x5. 0x6: QSPI FLASH un-cached (for verification only)
0x7: No remapping (only relevant for the CMAC Cache)</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SYS_STAT_REG</name>
	<description>System status register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000095a5</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>POWER_IS_UP</name>
	<description>Indicates that the Startup state machine is finished, and all power regulation are in order.
In Fast Wake-up mode, the software needs to wait for this signal before starting any heavy traffic.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DBG_IS_ACTIVE</name>
	<description>Indicates that a debugger is attached.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AUD_IS_UP</name>
	<description>Indicates that PD_AUD is functional </description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AUD_IS_DOWN</name>
	<description>Indicates that PD_AUD is in power down </description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COM_IS_UP</name>
	<description>Indicates that PD_COM is functional </description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COM_IS_DOWN</name>
	<description>Indicates that PD_COM is in power down </description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_IS_UP</name>
	<description>Indicates that PD_TIM is functional </description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIM_IS_DOWN</name>
	<description>Indicates that PD_TIM is in power down </description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MEM_IS_UP</name>
	<description>Indicates that PD_MEM is functional</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MEM_IS_DOWN</name>
	<description>Indicates that PD_MEM is in power down</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYS_IS_UP</name>
	<description>Indicates that PD_SYS is functional </description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYS_IS_DOWN</name>
	<description>Indicates that PD_SYS is in power down </description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PER_IS_UP</name>
	<description>Indicates that PD_PER is functional </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PER_IS_DOWN</name>
	<description>Indicates that PD_PER is in power down </description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RAD_IS_UP</name>
	<description>Indicates that PD_RAD is functional </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RAD_IS_DOWN</name>
	<description>Indicates that PD_RAD is in power down </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_XTAL</name>
	<version>1.0</version>
	<description>CRG_XTAL registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50010000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>108</size>
	<usage>registers</usage>
</addressBlock>

