honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1459x/toolbox_resources/common/DA1459x-00.xml
	<registers>
	<register>
	<name>CLKDBLR_CTRL1_REG</name>
	<description>Clock Doubler Control Logic control register 1</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x007fffff</resetMask>
	<fields><field>
	<name>DELAY_TDC_OVR</name>
	<description>Overrule value for the delay_tdc output.</description>
	<bitRange>[22:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DELAY_64M_PRE_OVR</name>
	<description>Overrule value for the delay_64m_pre output.</description>
	<bitRange>[16:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DELAY_64M_OVR</name>
	<description>Overrule value for the delay_64m output.</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DELAY_32M_OVR</name>
	<description>Overrule value for the delay_32m output.</description>
	<bitRange>[7:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OVERRIDE</name>
	<description>Bypass the Clock Doubler Control Logic.
0: Normal operation
1: Bypass the Control Logic and force its outputs to CLKDBLR_CTRL1_REG[DELAY*OVR] and CLKDBLR_CTRL2_REG[*OVR] values.
Override mode enabling sequence:
1. Set CLKDBLR_CTRL*_REG[*OVR] bits except CLKDBLR_CTRL2_REG[OUTPUT_ENABLE_OVR] to desired values.
2. Release the reset via CLKDBLR_CTRL1_REG[RESET_N]
3. Set CLKDBLR_CTRL1_REG[OVERRIDE] to 1.
4. Set CLKDBLR_CTRL2_REG[OUTPUT_ENABLE_OVR] to 1.
5. Set CLKDBLR_CTRL1_REG[ENABLE] to 1.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ENABLE</name>
	<description>Enable the Control Logic.
0: Disabled
1: Enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESET_N</name>
	<description>Reset the Control Logic.
0: Reset state
1: Normal operation.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLKDBLR_CTRL2_REG</name>
	<description>Clock Doubler Control Logic control register 2</description>
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DELAY_64M_PRE_OFFSET</name>
	<description>Offset to be added to the delay_64m_pre output.</description>
	<bitRange>[15:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PRELOAD</name>
	<description>Preload the internal registers with CLKDBLR_CTRL1_REG[DELAY*OVR] inputs to give a good starting point to the FSM.
0: Normal mode.
1: Preload mode.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INV_CLK</name>
	<description>Invert the clock of the tdc_in register.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DUTY_CYCLE_CORR_COUNT</name>
	<description>Duty cycle correction interval.
0: Maintenance mode disabled.
1..15: Re-calculate delay outputs every 2N clock cycles.</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LOW_POWER_OVR</name>
	<description>Overrule value for the low_power output.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EN_ADJ_32M_OVR</name>
	<description>Overrule value for the en_adj_32m.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EN_ADJ_64M_OVR</name>
	<description>Overrule value for the en_adj_64m.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EN_TDC_OVR</name>
	<description>Overrule value for the en_tdc.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PHASE_INV_32M_OVR</name>
	<description>Overrule value for the phase_inv_32m.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SEL_32M_64M_CLK_OVR</name>
	<description>Overrule value for the sel_32m_64m_clk</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TDC_CLK_INV_OVR</name>
	<description>Overrule value for the tdc_clk_inv.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUTPUT_ENABLE_OVR</name>
	<description>Overrule value for the output_enable.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLKDBLR_STATUS_REG</name>
	<description>Clock Doubler Control Logic status register</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PHASE_INV_32M</name>
	<description>Read-out of the phase_inv_32m output of the Clock Doubler Control Logic.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLKDBLR_STATE</name>
	<description>Read-out of the state of the Clock Doubler Control Logic FSM state.</description>
	<bitRange>[30:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>OUTPUT_READY</name>
	<description>Ready flag which indicates that 64 MHz clock is available
0: 64 MHz clock not available
1: 64 MHz clock available
Note: This is an output of the calibration FSM, indicating calibration is finished and 64 MHz clock should be available. It is not a signal which shows the actual status of the 64-MHz clock.</description>
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TDC_BIN_OUT</name>
	<description>TDC binary output.</description>
	<bitRange>[24:20]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DELAY_TDC_OUT</name>
	<description>Delay value for the TDC block.</description>
	<bitRange>[19:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DELAY_64M_PRE_OUT</name>
	<description>Delay value for the 64 MHz DTC block.</description>
	<bitRange>[13:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DELAY_64M_OUT</name>
	<description>Delay value for the 64 MHz DTC block.</description>
	<bitRange>[8:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DELAY_32M_OUT</name>
	<description>Delay value for the 32 MHz DTC block.</description>
	<bitRange>[4:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>XTAL32M_CAP_MEAS_REG</name>
	<description>Capacitance measure circuit control</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000098</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>XTAL32M_MEAS_TIME</name>
	<description>Select measurement time (in DIVN clock-cycles)
0: 32
1: 64

6: 2048
7: 4096</description>
	<bitRange>[8:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_MEAS_START</name>
	<description>Starts capacitance measurement</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_MEAS_CUR</name>
	<description>Select measurement current (minimum required capacitance)
0: 100 nA (0.44 pF)
1: 500 nA (2.22 pF)
2: 1 uA (4.44 pF)
3: 5 uA (22.2 pF)</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CAP_SELECT</name>
	<description>Select measured capacitance
0: disabled
1: hold capacitance
2: xtal_p
3: xtal_n
4: xtal_p + xtal_n
5: low reference on xtal_p
6: low reference on xtal_p</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_CTRL_REG</name>
	<description>Xtal32m control register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000015</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>XTAL32M_ENABLE</name>
	<description>Enables xtal32m (testing purposes)</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_BIASPROT</name>
	<description>Bias startup circuit
0: enable during startup
1: always enabled
2: always disabled</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_LDO_SAH</name>
	<description>Controls amplitude regulator sample-and-hold
2'b00: set to HOLD when IRQ fires
2'b01: always TRACK
2'b1x: always HOLD</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_AMPREG_SAH</name>
	<description>Controls amplitude regulator sample-and-hold
2'b00: set to HOLD when IRQ fires
2'b01: always TRACK
2'b1x: always HOLD</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_BIAS_SAH</name>
	<description>Controls bias sample-and-hold
2'b00: set to HOLD when IRQ fires
2'b01: always TRACK
2'b1x: always HOLD</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_FSM_REG</name>
	<description>Startup state machine configuration</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>XTAL32M_FSM_APPLY_CONFIG</name>
	<description>CUR_SET, AMPL_SET, CMP_LVL and TRIM from XTAL32M_TRIM_REG are
0: applied at next startup
1: immediately applied</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_FSM_FORCE_IDLE</name>
	<description>Forces FSM in IDLE state, allows for software control</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CMP_MODE</name>
	<description>Use following comparator trim settings in SETTLE state:
0: XTAL32M_TRIM_REG.CMP_LVL
1: XTAL32M_SETTLE_REG.CMP_LVL</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_TRIM_MODE</name>
	<description>Use following trimsetting in the SETTLE state
0: XTAL32M_TRIM_REG.TRIM
1: XTAL32M_SETTLE_REG.TRIM</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CUR_MODE</name>
	<description>Use the following current setting in the SETTLE state
0: XTAL32M_START_REG.CUR_SET
1: XTAL32M_SETTLE_REG.CUR_SET</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_IRQ_CTRL_REG</name>
	<description>Xtal32m Interrupt control register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000009ff</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>XTAL32M_IRQ_CAP_CTRL</name>
	<description>The IRQ counter is captured in the XTAL32M_IRQ_STATUS_REG.IRQ_COUNT_CAP when leaving the following state
0: START
1: SETTLE
2: RUN</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_IRQ_ENABLE</name>
	<description>Enable xtal interrupt generation.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_IRQ_CLK</name>
	<description>Clock divider for IRQ counter
0: 4 us
1: 32 us</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_IRQ_CNT</name>
	<description>IRQ counter start value.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_IRQ_STAT_REG</name>
	<description>XTAL32M IRQ status register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>XTAL32M_IRQ_COUNT_CAP</name>
	<description>Captured IRQ counter</description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_IRQ_COUNT_STAT</name>
	<description>Current IRQ counter value</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>XTAL32M_SETTLE_REG</name>
	<description>Trim values for XTAL32M in SETTLE state of startup</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000685a0</resetValue>
	<resetMask>0x07ffffff</resetMask>
	<fields><field>
	<name>XTAL32M_TIMEOUT</name>
	<description>Timeout
0: disabled
1: 4 us
2: 8 us

