honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1459x/toolbox_resources/common/DA1459x-00.xml
63: 252 us
64: 268 us
...
127: 1260 us</description>
	<bitRange>[26:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CMP_BLANK</name>
	<description>Blanking time for comparator output
0: disabled
1: 4 us
2: 8 us
3: 16 us
4: 32 us
5: 64 us</description>
	<bitRange>[19:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CMP_LVL</name>
	<description>Comparator triplevel
0: 2 uA
1: 4 uA
2: 8 uA
3: 12 uA</description>
	<bitRange>[16:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_AMPL_SET</name>
	<description>Amplitude Regulator input level setting (peak-peak) in SETTLE phase of startup
0: 300 mV
1: 350 mV
..
7: 900 mV</description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CUR_SET</name>
	<description>Current setting (uA) in SETTLE phase of startup
0: 32
1: 64
2: 128
3: 192
4: 256
5: 320
6: 384
7: 448
8: 512
9: 576
10: 640
11: 704
12: 768
13: 832
14: 960
15: 1088</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_TRIM</name>
	<description>Capacitance bank setting in SETLLE phase of startup
CL = 3.5 pF + 50 fF/LSB</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_START_REG</name>
	<description>Trim values for XTAL32M in START state of startup</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00070550</resetValue>
	<resetMask>0x07ffffff</resetMask>
	<fields><field>
	<name>XTAL32M_TIMEOUT</name>
	<description>Timeout
0: disabled
1: 4 us
2: 8 us

63: 252 us
64: 268 us
...
127: 1260 us</description>
	<bitRange>[26:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CMP_BLANK</name>
	<description>Blanking time for comparator output
0: disabled
1: 4 us
2: 8 us
3: 16 us
4: 32 us
5: 64 us</description>
	<bitRange>[19:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CMP_LVL</name>
	<description>Comparator triplevel
0: 2 uA
1: 4 uA
2: 8 uA
3: 12 uA</description>
	<bitRange>[16:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_AMPL_SET</name>
	<description>Amplitude Regulator input level setting (peak-peak) in START phase of startup
0: 300 mV
1: 350 mV
..
7: 900 mV</description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CUR_SET</name>
	<description>Current setting (uA) in START phase of startup
0: 32
1: 64
2: 128
3: 192
4: 256
5: 320
6: 384
7: 448
8: 512
9: 576
10: 640
11: 704
12: 768
13: 832
14: 960
15: 1088</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_TRIM</name>
	<description>Capacitance bank setting in START phase of startup
CL = 3.5 pF + 50 fF/LSB</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_STAT0_REG</name>
	<description>XTAL32M status register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>XTAL32M_TRIM_VAL</name>
	<description>Current value for oscillator trimming</description>
	<bitRange>[18:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_CUR_SET_STAT</name>
	<description>Current value for cur_set</description>
	<bitRange>[10:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_LDO_OK</name>
	<description>Indicates LDO voltage level is ok</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_CMP_OUT</name>
	<description>Amplitude regulator comparator output state</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_STATE</name>
	<description>State of xtal startup FSM
0x0: IDLE
0x1: WAIT_LDO
0x2: WAIT_BIAS
0x3: START_BLANK
0x4: START
0x5: SETTLE_BLANK
0x6: SETTLE
0x7: RUN
0x8: CAP_TEST_IDLE
0x9: CAP_TEST_MEAS
0xA: CAP_TEST_END</description>
	<bitRange>[4:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_READY</name>
	<description>Indicates xtal startup FSM has reached the RUNNING state and is ready for use (sysclk)</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>XTAL32M_TRIM_REG</name>
	<description>Trim values for XTAL32M in RUNNING state</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000084a0</resetValue>
	<resetMask>0x0001ffff</resetMask>
	<fields><field>
	<name>XTAL32M_CMP_LVL</name>
	<description>Comparator triplevel
0: 2 uA
1: 4 uA
2: 8 uA
3: 12 uA</description>
	<bitRange>[16:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_AMPL_SET</name>
	<description>Amplitude Regulator input level setting (peak-peak) in running phase
0: 300 mV
1: 350 mV
..
7: 900 mV</description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CUR_SET</name>
	<description>Current setting (uA) in running phase
0: 32
1: 64
2: 128
3: 192
4: 256
5: 320
6: 384
7: 448
8: 512
9: 576
10: 640
11: 704
12: 768
13: 832
14: 960
15: 1088</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_TRIM</name>
	<description>Capacitance bank setting in running phase, use to trim the xtal32m output frequency
CL = 3.5 pF + 50 fF/LSB</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DCDC</name>
	<version>1.0</version>
	<description>DCDC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000300</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>4</size>
	<usage>registers</usage>
</addressBlock>

