honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1459x/toolbox_resources/common/DA1459x-00.xml
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>DMA_SET_IRQ_ENABLE5</name>
	<description>Writing 1 will enable the IRQs in the DMA channel 5, writing 0 has no effect. Reading always returns 0.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_SET_IRQ_ENABLE4</name>
	<description>Writing 1 will enable the IRQs in the DMA channel 4, writing 0 has no effect. Reading always returns 0.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_SET_IRQ_ENABLE3</name>
	<description>Writing 1 will enable the IRQs in the DMA channel 3, writing 0 has no effect. Reading always returns 0.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_SET_IRQ_ENABLE2</name>
	<description>Writing 1 will enable the IRQs in the DMA channel 2, writing 0 has no effect. Reading always returns 0.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_SET_IRQ_ENABLE1</name>
	<description>Writing 1 will enable the IRQs in the DMA channel 1, writing 0 has no effect. Reading always returns 0..</description>
	<bitRange>[1:1]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_SET_IRQ_ENABLE0</name>
	<description>Writing 1 will enable the IRQs in the DMA channel 0, writing 0 has no effect. Reading always returns 0.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-writeOnce</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DW</name>
	<version>1.0</version>
	<description>DW registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x30020000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>148</size>
	<usage>registers</usage>
</addressBlock>

	<registers>
	<register>
	<name>AHB_DMA_CCLM1_REG</name>
	<description>RFTP Master clock tokens (AHB DMA layer only)</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_CCLM</name>
	<description>Number of tokens (counted in AHB clock cycles) that a master can use on the bus before it has to arbitrate on a bus master with low priority and having tokens. Masters with tokens remaining have priority over masters that have used all of their tokens. User should configure all the token values ensuring that the sum does not exceed the total allocated number of tokens. If a value of zero is configured, then the bus is deemed to have infinite tokens and will always operate in the upper-tier of arbitration.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_CCLM2_REG</name>
	<description>GPDMA Master clock tokens (AHB DMA layer only)</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_CCLM</name>
	<description>See AHB_DMA_CCLM1_REG</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_CCLM3_REG</name>
	<description>CRYPTO-DMA Master clock tokens (AHB DMA layer only)</description>
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_CCLM</name>
	<description>AHB_DMA_CCLM1_REG</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_CCLM4_REG</name>
	<description>DRA Master clock tokens (AHB DMA layer only)</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_CCLM</name>
	<description>AHB_DMA_CCLM1_REG</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_DFLT_MASTER_REG</name>
	<description>Default master ID number (AHB DMA layer only)</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_DFLT_MASTER</name>
	<description>Default master ID number register. The default master is the master that is granted by the bus when no master has requested ownership.
0: Dummy master
1: RFPT
2: GEN-DMA
3: CRYPTO-DMA
4: DRA</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_PL1_REG</name>
	<description>AHB-DMA layer priority level for RFTP (AHB DMA layer only)</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_PL1</name>
	<description>Arbitration priority for master RFPT. 0: lowest, 15: highest.</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_PL2_REG</name>
	<description>AHB-DMA layer priority level for GPDMA (AHB DMA layer only)</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000e</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_PL2</name>
	<description>Arbitration priority for master GPDMA. 0: lowest, 15: highest.</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_PL3_REG</name>
	<description>AHB-DMA layer Priority level for CRYPTO-DMA (AHB DMA layer only)</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000d</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_PL3</name>
	<description>Arbitration priority for master CRYPTO-DMA. 0: lowest, 15: highest.</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_PL4_REG</name>
	<description>AHB-DMA layer Priority level for DRA (AHB DMA layer only)</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000c</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_PL4</name>
	<description>Arbitration priority for master DRA-DMA. 0: lowest, 15: highest.</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_TCL_REG</name>
	<description>Master clock refresh period (AHB DMA layer only)</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000ffff</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_TCL</name>
	<description>Master clock refresh period, counting clock cycles. An arbitration period is defined over this number of tokens. When a new arbitration period starts, the master counters are reloaded. Recommended value is the sum of the AHB_DMA_CCLMx_REG values plus two tokens for each master, that is plus six.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_VERSION_REG</name>
	<description>Version ID (AHB DMA layer only)</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x3231332a</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_VERSION</name>
	<description>System bus verion ID</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_WTEN_REG</name>
	<description>Weighted-Token Arbitration Scheme Enable (AHB DMA layer only)</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_WTEN</name>
	<description>Weighted-token arbitration scheme enable.
0: Disabled
1: Enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>FCU</name>
	<version>1.0</version>
	<description>FCU registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50060100</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>36</size>
	<usage>registers</usage>
</addressBlock>

