honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1459x/toolbox_resources/common/DA1459x-00.xml
	<registers>
	<register>
	<name>FLASH_CTRL_REG</name>
	<description>Flash control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00020c00</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>DISCHARGE_STAT</name>
	<description>Flash discharging status
1: Discharging state
0: Normal operation</description>
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DFT_EN</name>
	<description>1: Enable DFT logic, programming Flash through pins</description>
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VDD_LEVEL_VALUE</name>
	<description>If VDD_LEVEL_FORCE is set to 0, this register field has no effect.
If VDD_LEVEL_FORCE is set to 1, then if VDD_LEVEL_VALUE is:
1: sets vdd_level value to 1 (Should be used if VDD &gt; 1.08 V. Results in Flash input LVEN = 0)
0: sets vdd_level_value to 0 (Should be used if VDD &lt; 1.08 V. Results in Flash input LVEN = 1)</description>
	<bitRange>[23:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VDD_LEVEL_FORCE</name>
	<description>Used with VDD_LEVEL_VALUE to override the vdd_level FCU input signal, to set the LVEN Flash input signal.
This register does not affect the actual VDD level. It only affects the indication to the FCU.
1: Override vdd_level input and force vdd_level to VDD_LEVEL_VALUE
0: Use vdd_level input and do not use VDD_LEVEL_VALUE register field </description>
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ERASE_RESUME</name>
	<description>Resumes erase on writing 1.</description>
	<bitRange>[21:21]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>ERASE_SUSPEND_STAT</name>
	<description>Erase Suspend status
1: FLASH erase is suspended. Check FLASH_RTERASE_TOT_CNT_REG for the remaining time needed for the erase to complete.
0: FLASH erase is not suspended. Check PROG_ERS status bit for the erase cycle status.</description>
	<bitRange>[20:20]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ERASE_SUSPEND_MODE</name>
	<description>Choose mode of erase suspend operation:
1:When a read operation is issued, FCU stalls the read access until the erase segment is completed.
0:When a read operation is issued, erase is immediately suspended and erase segment time is not subtracted from total erase time</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ERASE_SUSPEND_EN</name>
	<description>1: Enable erase suspend functionality</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SLEEP</name>
	<description>Sleep mode status
1: FCU is in sleeping mode. This register's value is cleared on the next read access, and the FCU automatically wakes up.
0: FCU is in standby mode.</description>
	<bitRange>[17:17]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_EN</name>
	<description>1: Enable DMA handshake when writing to the FCU. It also disables IRQ generation.
0: Disable DMA handshake when writing to the FCU. IRQ generation remains enabled.</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUS_ERROR_EN</name>
	<description>1: Bus error response enabled.
0: Bus error response disabled.
The BUS_ERROR status register is not affected by this register's value.
This bit can only be set!! and is reset by RSTn.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>BUS_ERROR</name>
	<description>Flash bus error status
1: Bus error occurred in the last FCU AHB access. Register gets cleared on next FCU AHB access.
0: Bus error did not occur in the last FCU AHB access. </description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IRQ_CLEAR</name>
	<description>Clears the IRQ on writing 1</description>
	<bitRange>[13:13]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>WAIT_CYCLES</name>
	<description>Number of wait cycles to be programmed in case HCLK is faster than the worst case access time (Tacc) specified in the Flash memory datasheet.
0: 0 wait cycles
1: 1 wait cycle
2: 2 wait cycles (default)
3: 3 wait cycles
4: 4 wait cycles
5: 5 wait cycles
6: 6 wait cycles
7: 7 wait cycles
Note: When dcore is running at 0.9 V, worst case Tacc = 65 ns, when running at 1.2 V, worst case Tacc = 23 ns.
The combinatorial path from cell to DFF is 5.66 ns.
Use cases:
HCLK = 64 MHz, VDD = 1.2 V -&gt; 1 wait cycles
HCLK = 32 MHz, VDD = 0.9 V -&gt; 2 wait cycles (default conditions on power up)
HCLK = 32 MHz, VDD = 1.2 V -&gt; 0 wait cycles
HCLK = 16 MHz, VDD = 0.9 V -&gt; 1 wait cycles
HCLK = 16 MHz, VDD = 1.2 V -&gt; 0 wait cycles
HCLK = slower than above -&gt; 0 wait cycles

Warning: User must not use 0 wait cycles with 64 MHz clk.</description>
	<bitRange>[12:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FLASH_RPROT</name>
	<description>If 1 the FLASH can not be read.
This bit can only be set and is reset by RSTn.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>FLASH_WPROT</name>
	<description>If 1 the FLASH cannot be written/erased.
This bit can only be set and is reset by RSTn.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>FLASH_PROT</name>
	<description>If 1 the FLASH can not be read, written or erased.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PROG_RMIN</name>
	<description>FLASH read mode inhibit.
1: Read mode may not be selected after a write, page
erase or mass erase of the selected FLASH as long as this
bit is 1.
0: Read mode may be selected.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PROG_ERS</name>
	<description>FLASH erase status
1: Erase cycle in progress
0: Erase cycle ready</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PROG_WRS</name>
	<description>FLASH write status
1: Write cycle in progress
0: Write cycle ready</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PROG_SEL</name>
	<description>Select FLASH access mode:
0 : FLASH: Read access mode selected
1 : FLASH: Erase/write access mode selected
Must be set back to 0 to reduce power consumption.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SLEEP_MODE</name>
	<description>Puts flash in sleep mode for lower leakage current on writing 1.
Automatically wakes up on read access.</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>PROG_MODE</name>
	<description>Select FLASH programming mode
00 : No write or erase to flash(es) possible.
01 : Write page
10 : Erase page. Address first written to select page.
11 : Erase one of the flash blocks completely (bulk erase)
If the address that starts the erase belongs to the info block, info block and main block are mass erased.
If the address that starts the erase belongs to the main block, only the main block is erased.
To only erase the info block, a page erase of the info block must be done.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FLASH_PTERASE_REG</name>
	<description>Page Erase time register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00013880</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>PTERASE</name>
	<description>Program flash page Erase time.
T= PTERASE x 1 us = 80 ms (min)
This register can be programmed with values from 1 up to 262143.</description>
	<bitRange>[23:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FLASH_PTERASE_SEG_REG</name>
	<description>Page erase segment time register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000003e8</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>PTERASE_SEG</name>
	<description>Program flash segment of page erase time for suspend erase.
T=PTERASE_SEG x 1 us = 1 ms
This register can be programmed with values from 1 up to 262143.
Note: PTERASE should be a multiple of PTERASE_SEG</description>
	<bitRange>[23:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FLASH_PTME_REG</name>
	<description>Mass Erase time register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00013880</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>PTME</name>
	<description>Program flash mass Erase time.
T= PTME x 1 us = 80 ms (min)
This register can be programmed with values from 1 up to 262143.</description>
	<bitRange>[23:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FLASH_PTNVH1_REG</name>
	<description>NVSTR1 hold time register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000064</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PTNVH1</name>
	<description>Program flash NVSTR1 hold time.
T = PTNVH1 x 1 us = 100 us (min)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FLASH_PTPROG_REG</name>
	<description>Flash programming time register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PTPROG</name>
	<description>Program flash programming time.
T = PTPROG x 1 us = 8 us (min)</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FLASH_PTWK_SP_REG</name>
	<description>Wake-up time of sleep to standby register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>PTWK_SP</name>
	<description>Program flash wake-up time of sleep to standby
T=PTWK_SP x 1 us = 3 us</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FLASH_RTERASE_SEG_CNT_REG</name>
	<description>Segment erase time counter register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>RTERASE_SEG_CNT</name>
	<description>Returns segment erase time counter value. </description>
	<bitRange>[23:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>FLASH_RTERASE_TOT_CNT_REG</name>
	<description>Total erase time counter register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>RTERASE_TOT_CNT</name>
	<description>Returns total erase time counter value. </description>
	<bitRange>[23:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GPADC</name>
	<version>1.0</version>
	<description>GPADC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040900</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>36</size>
	<usage>registers</usage>
</addressBlock>

