honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1459x/toolbox_resources/common/DA1459x-00.xml
	<registers>
	<register>
	<name>MDCT_CTRL_REG</name>
	<description>MDCT control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x80000000</resetValue>
	<resetMask>0xbfffffff</resetMask>
	<fields><field>
	<name>DONE</name>
	<description>Done flag
0: Operation in progress
1: Operation complete</description>
	<bitRange>[31:31]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>USE_CORDIC</name>
	<description>Select source for twiddle factors
0: Use table stored in Y buffer
1: Generate using CORDIC block</description>
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_CLR</name>
	<description>Clear IRQ on writing 1.</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLK_DIV</name>
	<description>Division factor for MDCT core. The source for the division is always the DIV1 CLK.
0x0: Clock disabled
0x1: Divide by 1
0x2: Divide by 2
0x3: Divide by 4 </description>
	<bitRange>[27:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XFORM_SIZE</name>
	<description>Transform size (XFORM_SIZE = transform size - 1)</description>
	<bitRange>[25:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>Y_STRIDE</name>
	<description>Y buffer data stride (Y_STRIDE = stride - 1)</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WORD_SIZE</name>
	<description>Data size
0: 16-bit
1: 32-bit</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INVERSE</name>
	<description>Transform direction
0: Forward
1: Reverse (inverse)</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>N_STAGES</name>
	<description>Number of transform stages.</description>
	<bitRange>[5:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IRQ_EN</name>
	<description>MDCT IRQ enable.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EN</name>
	<description>MDCT enable.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MDCT_PHASE_INC_REG</name>
	<description>MDCT phase increment register for CORDIC</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PHASE_INC</name>
	<description>Phase increment used by CORDIC generator in Q1.31 unsigned fixed-point representation.
PHASE_INC = 2^32/XFORM_SIZE</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MDCT_STAGE0_REG</name>
	<description>MDCT stage 0 settings register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xfffff7f7</resetMask>
	<fields><field>
	<name>STRIDE</name>
	<description>Stride (STRIDE = stride-1)</description>
	<bitRange>[31:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>M</name>
	<description>Sub-transform size (M = sub-transform size-1)</description>
	<bitRange>[21:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIX</name>
	<description>Radix of butterflies
0: Radix-2
1: Radix-3
2: Radix-4
3: Radix-5</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_ADDR_MODE</name>
	<description>Input addressing mode
0: Linear
1: Bit/digit reversed</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT_BUFFER</name>
	<description>Output buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_BUFFER</name>
	<description>Input buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODE</name>
	<description>Mode
0: Disabled
1: Complex FFT
2: Real FFT
3: DCT (Type IV)
4: Window function
5-7: reserved</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MDCT_STAGE1_REG</name>
	<description>MDCT stage 1 settings register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xfffff7f7</resetMask>
	<fields><field>
	<name>STRIDE</name>
	<description>Stride (STRIDE = stride-1)</description>
	<bitRange>[31:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>M</name>
	<description>Sub-transform size (M = sub-transform size-1)</description>
	<bitRange>[21:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIX</name>
	<description>Radix of butterflies
0: Radix-2
1: Radix-3
2: Radix-4
3: Radix-5</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_ADDR_MODE</name>
	<description>Input addressing mode
0: linear
1: bit/digit reversed</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT_BUFFER</name>
	<description>Output buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_BUFFER</name>
	<description>Input buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODE</name>
	<description>Mode
0: Disabled
1: Complex FFT
2: Real FFT
3: DCT (Type IV)
4: Window function
5-7: reserved</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MDCT_STAGE2_REG</name>
	<description>MDCT stage 2 settings register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xfffff7f7</resetMask>
	<fields><field>
	<name>STRIDE</name>
	<description>Stride (STRIDE = stride-1)</description>
	<bitRange>[31:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>M</name>
	<description>Sub-transform size (M = sub-transform size-1)</description>
	<bitRange>[21:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIX</name>
	<description>Radix of butterflies
0: Radix-2
1: Radix-3
2: Radix-4
3: Radix-5</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_ADDR_MODE</name>
	<description>Input addressing mode
0: Linear
1: Bit/digit reversed</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT_BUFFER</name>
	<description>Output buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_BUFFER</name>
	<description>Input buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODE</name>
	<description>Mode
0: Disabled
1: Complex FFT
2: Real FFT
3: DCT (Type IV)
4: Window function
5-7: reserved</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MDCT_STAGE3_REG</name>
	<description>MDCT stage 3 settings register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xfffff7f7</resetMask>
	<fields><field>
	<name>STRIDE</name>
	<description>Stride (STRIDE = stride-1)</description>
	<bitRange>[31:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>M</name>
	<description>Sub-transform size (M = sub-transform size-1)</description>
	<bitRange>[21:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIX</name>
	<description>Radix of butterflies
0: Radix-2
1: Radix-3
2: Radix-4
3: Radix-5</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_ADDR_MODE</name>
	<description>Input addressing mode
0: Linear
1: Bit/digit reversed</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT_BUFFER</name>
	<description>Output buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_BUFFER</name>
	<description>Input buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODE</name>
	<description>Mode
0: Disabled
1: Complex FFT
2: Real FFT
3: DCT (Type IV)
4: Window function
5-7: reserved</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MDCT_STAGE4_REG</name>
	<description>MDCT stage 4 settings register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xfffff7f7</resetMask>
	<fields><field>
	<name>STRIDE</name>
	<description>Stride (STRIDE = stride-1)</description>
	<bitRange>[31:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>M</name>
	<description>Sub-transform size (M = sub-transform size-1)</description>
	<bitRange>[21:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIX</name>
	<description>Radix of butterflies
0: Radix-2
1: Radix-3
2: Radix-4
3: Radix-5</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_ADDR_MODE</name>
	<description>Input addressing mode
0: Linear
1: Bit/digit reversed</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT_BUFFER</name>
	<description>Output buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_BUFFER</name>
	<description>Input buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODE</name>
	<description>Mode
0: Disabled
1: Complex FFT
2: Real FFT
3: DCT (Type IV)
4: Window function
5-7: reserved</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MDCT_STAGE5_REG</name>
	<description>MDCT stage 5 settings register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xfffff7f7</resetMask>
	<fields><field>
	<name>STRIDE</name>
	<description>Stride (STRIDE = stride-1)</description>
	<bitRange>[31:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>M</name>
	<description>Sub-transform size (M = sub-transform size-1)</description>
	<bitRange>[21:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIX</name>
	<description>Radix of butterflies
0: Radix-2
1: Radix-3
2: Radix-4
3: Radix-5</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_ADDR_MODE</name>
	<description>Input addressing mode
0: Linear
1: Bit/digit reversed</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT_BUFFER</name>
	<description>Output buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_BUFFER</name>
	<description>Input buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODE</name>
	<description>Mode
0: Disabled
1: Complex FFT
2: Real FFT
3: DCT (Type IV)
4: Window function
5-7: reserved</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MDCT_STAGE6_REG</name>
	<description>MDCT stage 6 settings register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xfffff7f7</resetMask>
	<fields><field>
	<name>STRIDE</name>
	<description>Stride (STRIDE = stride-1)</description>
	<bitRange>[31:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>M</name>
	<description>Sub-transform size (M = sub-transform size-1)</description>
	<bitRange>[21:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIX</name>
	<description>Radix of butterflies
0: Radix-2
1: Radix-3
2: Radix-4
3: Radix-5</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_ADDR_MODE</name>
	<description>Input addressing mode
0: Linear
1: Bit/digit reversed</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT_BUFFER</name>
	<description>Output buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_BUFFER</name>
	<description>Input buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODE</name>
	<description>Mode
0: Disabled
1: Complex FFT
2: Real FFT
3: DCT (Type IV)
4: Window function
5-7: reserved</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MDCT_STAGE7_REG</name>
	<description>MDCT stage 7 settings register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xfffff7f7</resetMask>
	<fields><field>
	<name>STRIDE</name>
	<description>Stride (STRIDE = stride-1)</description>
	<bitRange>[31:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>M</name>
	<description>Sub-transform size (M = sub-transform size-1)</description>
	<bitRange>[21:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RADIX</name>
	<description>Radix of butterflies
0: Radix-2
1: Radix-3
2: Radix-4
3: Radix-5</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_ADDR_MODE</name>
	<description>Input addressing mode
0: Linear
1: Bit/digit reversed</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OUT_BUFFER</name>
	<description>Output buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IN_BUFFER</name>
	<description>Input buffer
0: X buffer
1: Z buffer</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MODE</name>
	<description>Mode
0: Disabled
1: Complex FFT
2: Real FFT
3: DCT (Type IV)
4: Window function
5-7: reserved</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MDCT_XBASE_ADDR_REG</name>
	<description>MDCT X data base address register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>XBASE_ADDR</name>
	<description>X data base address.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MDCT_YBASE_ADDR_REG</name>
	<description>MDCT Y data base address register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>YBASE_ADDR</name>
	<description>Y data base address.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MDCT_ZBASE_ADDR_REG</name>
	<description>MDCT Z data base address register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>ZBASE_ADDR</name>
	<description>Z data base address.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>MEMCTRL</name>
	<version>1.0</version>
	<description>MEMCTRL registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50060000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>128</size>
	<usage>registers</usage>
</addressBlock>

