honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1459x/toolbox_resources/common/DA1459x-00.xml
	<registers>
	<register>
	<name>BUSY_RESET_REG</name>
	<description>BSR Reset Register</description>
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BUSY_SPARE</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[31:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_SPARE1</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[29:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_TIMER4</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[27:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_TIMER3</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[25:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_TIMER2</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[23:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_TIMER</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[21:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_PDM</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[19:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_PCM</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_SRC2</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[15:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_SRC</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[13:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_SDADC</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_GPADC</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_I2C</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_SPI</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_UART2</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUSY_UART</name>
	<description>Clear the BUSY bitfield, by writing the master code which has claimed to this field
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BUSY_SET_REG</name>
	<description>BSR Set Register</description>
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BUSY_SPARE</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[31:30]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_SPARE1</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[29:28]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_TIMER4</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[27:26]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_TIMER3</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[25:24]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_TIMER2</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[23:22]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_TIMER</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[21:20]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_PDM</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[19:18]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_PCM</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[17:16]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_SRC2</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[15:14]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_SRC</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[13:12]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_SDADC</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[11:10]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_GPADC</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[9:8]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_I2C</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[7:6]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_SPI</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[5:4]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_UART2</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[3:2]</bitRange>
	<access>writeOnce</access>
	</field><field>
	<name>BUSY_UART</name>
	<description>Writing a non-zero value to this field sets the corresponding BUSY bit, but only if it was not claimed (BUSY=0).
Reading returns 0 to allow read/modify/write to the register.</description>
	<bitRange>[1:0]</bitRange>
	<access>writeOnce</access>
	</field></fields>
</register><register>
	<name>BUSY_STAT_REG</name>
	<description>BSR Status Register</description>
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BUSY_SPARE</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[31:30]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_SPARE1</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[29:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_TIMER4</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[27:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_TIMER3</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[25:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_TIMER2</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[23:22]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_TIMER</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[21:20]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_PDM</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[19:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_PCM</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[17:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_SRC2</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_SRC</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[13:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_SDADC</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[11:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_GPADC</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[9:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_I2C</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[7:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_SPI</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_UART2</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUSY_UART</name>
	<description>A non-zero value indicates the resource is busy. The value represents which master is using it.</description>
	<bitRange>[1:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CMI_CODE_BASE_REG</name>
	<description>CMAC code Base Address Register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0007ffff</resetMask>
	<fields><field>
	<name>CMI_CODE_BASE_ADDR</name>
	<description>The complete register value is a location to System RAM (limited to this area), where the CMAC code segment is remapped.</description>
	<bitRange>[18:8]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CMI_DATA_BASE_REG</name>
	<description>CMAC data Base Address Register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0007ffff</resetMask>
	<fields><field>
	<name>CMI_DATA_BASE_ADDR</name>
	<description>The complete register value is a location to System RAM (limited to this area), where the CMAC data segment is remapped.
Typically this value is higher than CMI_CODE_BASE_REG.</description>
	<bitRange>[18:2]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CMI_SHARED_BASE_REG</name>
	<description>CMAC shared data Base Address Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0007ffff</resetMask>
	<fields><field>
	<name>CMI_SHARED_BASE_ADDR</name>
	<description>The complete register value is a location to System RAM (limited to this area), where the CMAC shared data segment is remapped.
Typically this value is higher than CMI_DATA_BASE_REG.</description>
	<bitRange>[18:2]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MEM_PRIO_REG</name>
	<description>Priority Control Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>AHB3_PRIO</name>
	<description>Priority of the AHB3 interface for the arbitration that is performed per memory cell. Six priority classes are supported, from priority class 0 (lowest priority) to priority class 5 (highest priority).The AHB3 interface can participate in one of the priority classes by setting the corresponding value: from 0 up to 5. The values 6 and 7 are reserved.</description>
	<bitRange>[8:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AHB2_PRIO</name>
	<description>Priority of the AHB2 interface for the arbitration that is performed per memory cell. Six priority classes are supported, from priority class 0 (lowest priority) to priority class 5 (highest priority).The AHB2 interface can participate in one of the priority classes by setting the corresponding value: from 0 up to 5. The values 6 and 7 are reserved.</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AHB_PRIO</name>
	<description>Priority of the AHB interface for the arbitration that is performed per memory cell. Six priority classes are supported, from priority class 0 (lowest priority) to priority class 5 (highest priority).The AHB interface can participate in one of the priority classes by setting the corresponding value: from 0 up to 5. The values 6 and 7 are reserved.</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MEM_STALL_REG</name>
	<description>Maximum Stall cycles Control Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00ffffff</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>AHB3_MAX_STALL</name>
	<description>Maximum allowed number of stall cycles for the AHB3 interface. If exceeded, the interface will get top priority (above high priority). Valid for a single access so the next access (of a burst) might end up in the queue for the same number of wait cycles.
0: do not use, not feasible and can block other interfaces
1: max 1 stall cycle
15: max 15 stall cycles</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AHB2_MAX_STALL</name>
	<description>Maximum allowed number of stall cycles for the AHB2 interface. If exceeded, the interface will get top priority (above high priority). Valid for a single access so the next access (of a burst) might end up in the queue for the same number of wait cycles.
0: do not use, not feasible and can block other interfaces
1: max 1 stall cycle
15: max 15 stall cycles</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AHB_MAX_STALL</name>
	<description>Maximum allowed number of stall cycles for the AHB interface. If exceeded, the interface will get top priority (above high priority). Valid for a single access so the next access (of a burst) might end up in the queue for the same number of wait cycles.
0: do not use, not feasible and can block other interfaces
1: max 1 stall cycle
15: max 15 stall cycles</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MEM_STATUS2_REG</name>
	<description>RAM cells Status Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>RAM3_OFF_BUT_ACCESS</name>
	<description>Reading 1 indicates RAM3 was off but still access was performed.
Writing 1 will clear the status back to 0.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM2_OFF_BUT_ACCESS</name>
	<description>Reading 1 indicates RAM2 was off but still access was performed.
Writing 1 will clear the status back to 0.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM1_OFF_BUT_ACCESS</name>
	<description>Reading 1 indicates RAM1 was off but still access was performed.
Writing 1 will clear the status back to 0.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MEM_STATUS_REG</name>
	<description>Memory Arbiter Status Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x003fff77</resetMask>
	<fields><field>
	<name>MTB_CLEAR_READY</name>
	<description>Writing 1 clears MTB_NOT_READY bit.</description>
	<bitRange>[21:21]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>MTB_NOT_READY</name>
	<description>0: Normal operation
1: MTB access performed which could not be handled right away (interface does not allow wait cycles)</description>
	<bitRange>[20:20]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB3_WR_BUFF_CNT</name>
	<description>The maximum number of arbiter clock cycles that an AHB3 access has been buffered.</description>
	<bitRange>[19:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB2_WR_BUFF_CNT</name>
	<description>The maximum number of arbiter clock cycles that an AHB2 access has been buffered.</description>
	<bitRange>[15:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB_WR_BUFF_CNT</name>
	<description>The maximum number of arbiter clock cycles that an AHB access has been buffered.</description>
	<bitRange>[11:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB3_CLR_WR_BUFF</name>
	<description>Writing 1 clears AHB3_WR_BUFF_CNT.</description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>AHB2_CLR_WR_BUFF</name>
	<description>Writing 1 clears AHB2_WR_BUFF_CNT.</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>AHB_CLR_WR_BUFF</name>
	<description>Writing 1 clears AHB_WR_BUFF_CNT.</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>AHB3_WRITE_BUFF</name>
	<description>0: No AHB3 write access is buffered.
1: Currently a single AHB3 write access is buffered in the arbiter.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB2_WRITE_BUFF</name>
	<description>0: No AHB2 write access is buffered.
1: Currently a single AHB2 write access is buffered in the arbiter.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB_WRITE_BUFF</name>
	<description>0: No AHB write access is buffered.
1: Currently a single AHB write access is buffered in the arbiter.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>PCM1</name>
	<version>1.0</version>
	<description>PCM1 registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50030300</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>20</size>
	<usage>registers</usage>
</addressBlock>

