honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1459x/toolbox_resources/common/DA1459x-00.xml
	<registers>
	<register>
	<name>QDEC_CLOCKDIV_REG</name>
	<description>Clock divider register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000003e7</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields><field>
	<name>QDEC_PRESCALER_EN</name>
	<description>0 = no prescaler enabled
1 = in sleep and active mode, quadrature clock is divided by 2</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_CLOCKDIV</name>
	<description>Contains the number of the input clock cycles minus one, that are required to generate one logic clock cycle.
Clock divider is bypassed when system runs at LP_CLK</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>QDEC_CTRL2_REG</name>
	<description>Quad Decoder port selection register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00007321</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>QDEC_CHZ_EVENT_MODE</name>
	<description>0 = Normal quadrature counting
1 = Counts rising and falling edge of both ports (if both ports change at the same time, counter increases by 1)</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_CHY_EVENT_MODE</name>
	<description>0 = Normal quadrature counting
1 = Counts rising and falling edge of both ports (if both ports change at the same time, counter increases by 1)</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_CHX_EVENT_MODE</name>
	<description>0 = Normal quadrature counting
1 = Counts rising and falling edge of both ports (if both ports change at the same time, counter increases by 1)</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_CHZ_PORT_SEL</name>
	<description>Defines which GPIOs are mapped on Channel Z
0: none
1: P0_00 -&gt; CHZ_A, P0_01 -&gt; CHZ_B
2: P0_02 -&gt; CHZ_A, P0_03 -&gt; CHZ_B
3: P0_04 -&gt; CHZ_A, P0_05 -&gt; CHZ_B
4: P0_08 -&gt; CHZ_A, P0_09 -&gt; CHZ_B
5: P0_10 -&gt; CHZ_A, P0_11 -&gt; CHZ_B
6: P1_00 -&gt; CHZ_A, P1_02 -&gt; CHZ_B
7: P1_03 -&gt; CHZ_A, P1_05 -&gt; CHZ_B
8: P1_06 -&gt; CHZ_A, P1_07 -&gt; CHZ_B
9: P1_08 -&gt; CHZ_A, P1_09 -&gt; CHZ_B
10: P1_10 -&gt; CHZ_A, P1_11 -&gt; CHZ_B
11: P1_12 -&gt; CHZ_A, P1_01 -&gt; CHZ_B
12: P1_04 -&gt; CHZ_A, P1_15 -&gt; CHZ_B
13-31: none</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_CHY_PORT_SEL</name>
	<description>Defines which GPIOs are mapped on Channel Y
0: none
1: P0_00 -&gt; CHY_A, P0_01 -&gt; CHY_B
2: P0_02 -&gt; CHY_A, P0_03 -&gt; CHY_B
3: P0_04 -&gt; CHY_A, P0_05 -&gt; CHY_B
4: P0_08 -&gt; CHY_A, P0_09 -&gt; CHY_B
5: P0_10 -&gt; CHY_A, P0_11 -&gt; CHY_B
6: P1_00 -&gt; CHY_A, P1_02 -&gt; CHY_B
7: P1_03 -&gt; CHY_A, P1_05 -&gt; CHY_B
8: P1_06 -&gt; CHY_A, P1_07 -&gt; CHY_B
9: P1_08 -&gt; CHY_A, P1_09 -&gt; CHY_B
10: P1_10 -&gt; CHY_A, P1_11 -&gt; CHY_B
11: P1_12 -&gt; CHY_A, P1_01 -&gt; CHY_B
12: P1_04 -&gt; CHY_A, P1_15 -&gt; CHY_B
13-31: none</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_CHX_PORT_SEL</name>
	<description>Defines which GPIOs are mapped on Channel X
0: none
1: P0_00 -&gt; CHX_A, P0_01 -&gt; CHX_B
2: P0_02 -&gt; CHX_A, P0_03 -&gt; CHX_B
3: P0_04 -&gt; CHX_A, P0_05 -&gt; CHX_B
4: P0_08 -&gt; CHX_A, P0_09 -&gt; CHX_B
5: P0_10 -&gt; CHX_A, P0_11 -&gt; CHX_B
6: P1_00 -&gt; CHX_A, P1_02 -&gt; CHX_B
7: P1_03 -&gt; CHX_A, P1_05 -&gt; CHX_B
8: P1_06 -&gt; CHX_A, P1_07 -&gt; CHX_B
9: P1_08 -&gt; CHX_A, P1_09 -&gt; CHX_B
10: P1_10 -&gt; CHX_A, P1_11 -&gt; CHX_B
11: P1_12 -&gt; CHX_A, P1_01 -&gt; CHX_B
12: P1_04 -&gt; CHX_A, P1_15 -&gt; CHX_B
13-31: none</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>QDEC_CTRL_REG</name>
	<description>Quad Decoder control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields><field>
	<name>QDEC_IRQ_THRES</name>
	<description>Defines the number of events on either counter (X or Y or Z) that need to be reached before an interrupt is generated. Events are equal to QDEC_IRQ_THRES+1.</description>
	<bitRange>[10:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_IRQ_STATUS</name>
	<description>1 = Interrupt has occurred
0 = No interrupt pending
Writing 1 clears the pending interrupt </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_EVENT_CNT_CLR</name>
	<description>Writing 1 QDEC_EVENT_CNT_REG is cleared</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_IRQ_ENABLE</name>
	<description>0 = Interrupt is masked
1 = Interrupt is enabled </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>QDEC_EVENT_CNT_REG</name>
	<description>Event counter register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>QDEC_EVENT_CNT</name>
	<description>Gives the number of events at all channels.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>QDEC_XCNT_REG</name>
	<description>Counter value of the X Axis</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>QDEC_X_CNT</name>
	<description>Contains a signed value of the events. Zero when channel is disabled </description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>QDEC_YCNT_REG</name>
	<description>Counter value of the Y Axis</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>QDEC_Y_CNT</name>
	<description>Contains a signed value of the events. Zero when channel is disabled</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>QDEC_ZCNT_REG</name>
	<description>Counter value of the Z Axis</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>QDEC_Z_CNT</name>
	<description>Contains a signed value of the events. Zero when channel is disabled</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>RTC</name>
	<version>1.0</version>
	<description>RTC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000400</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>152</size>
	<usage>registers</usage>
</addressBlock>

