honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1459x/toolbox_resources/common/DA1459x-00.xml
	<registers>
	<register>
	<name>SDADC_AUDIO_FILT_REG</name>
	<description>Sigma Delta ADC Audio Filter Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x001fffff</resetMask>
	<fields><field>
	<name>SDADC_CIC_OFFSET</name>
	<description>Constant CIC offset</description>
	<bitRange>[20:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SDADC_CLEAR_INT_REG</name>
	<description>Sigma Delta ADC Clear Interrupt Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>SDADC_CLR_INT</name>
	<description>Writing any value to this register will clear the ADC_INT interrupt. Reading returns 0. </description>
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>SDADC_CTRL_REG</name>
	<description>Sigma Delta ADC Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x001fffff</resetMask>
	<fields><field>
	<name>SDADC_VREF_TO_PAD</name>
	<description>Connect internal SDADC reference voltage VREF (0.9 V) to P1[5]
0: Disconnected (default)
1: Connected</description>
	<bitRange>[20:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_MODE</name>
	<description>Select the mode of operation for the SDADC
0: Sensor mode
1: Audio mode</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_DMA_EN</name>
	<description>0: DMA functionality disabled
1: DMA functionality enabled</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_MINT</name>
	<description>0: Disable (mask) SDADC_ADC_INT.
1: Enable SDADC_ADC_INT to ICU.</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_INT</name>
	<description>1: AD conversion ready and has generated an interrupt. Must be cleared by writing any value to SDADC_CLEAR_INT_REG.</description>
	<bitRange>[16:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SDADC_LDO_OK</name>
	<description>1: Internal LDO is ready for use</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SDADC_VREF_SEL</name>
	<description>Select the reference input:
00: VREFN=internal VREFP=internal
01: VREFN=internal VREFP=external (pin P1[5])
10: VREFN=external (pin P1[6]) VREFP=internal
11: VREFN=external (pin P1[6]) VREFP=external(pin P1[5])</description>
	<bitRange>[14:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_CONT</name>
	<description>0: Manual ADC mode, a single result will be generated after setting the SDADC_START bit.
1: Continuous ADC mode, new ADC results will be constantly stored in SDADC_RESULT_REG. Still SDADC_START has to be set to start the execution. Wait for SDADC_START to become zero after clearing the SDADC_CONT bit to stop the continuous mode.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_OSR</name>
	<description>Oversample Rate in sensor mode. SDADC_MODE = 0x1
0: 256x
1: 512x
2: 1024x
3: 2048x
The OSR in audio mode is fixed: OSR = 62.5</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_SE</name>
	<description>0: Differential mode
1: Single ended mode (Input selection negative side is ignored)</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_INN_SEL</name>
	<description>Input selection of negative side.
0: ADC0/P1[00]
1: ADC1/P1[01]
2: ADC2/P1[02]
3: ADC3/P0[10]
4: ADC4/P1[05]
5: ADC5/P1[06]
6: ADC6/P1[09]
7: ADC7/P1[11]</description>
	<bitRange>[8:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_INP_SEL</name>
	<description>Input selection of positive side.
0: ADC0/P1[00]
1: ADC1/P1[01]
2: ADC2/P1[02]
3: ADC3/P0[10]
4: ADC4/P1[05]
5: ADC5/P1[06]
6: ADC6/P1[09]
7: ADC7/P1[11]
8: VBAT (via 4x attenuator, INN connected to ground)</description>
	<bitRange>[5:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_START</name>
	<description>0: ADC conversion ready.
1: If a 1 is written, the ADC starts a conversion. After the conversion this bit will be set to 0 and the SDADC_INT bit will be set. It is not allowed to write this bit while it is not (yet) zero.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SDADC_EN</name>
	<description>0: LDO is off and ADC is disabled.
1: LDO, bias currents and modulator are enabled.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SDADC_GAIN_CORR_REG</name>
	<description>Sigma Delta ADC Gain Correction Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>SDADC_GAIN_CORR</name>
	<description>Gain adjust</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SDADC_OFFS_CORR_REG</name>
	<description>Sigma Delta ADC Offset Correction Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SDADC_OFFS_CORR</name>
	<description>Offset adjust</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SDADC_PGA_CTRL_REG</name>
	<description>Sigma Delta ADC PGA Control Registers</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000020</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>PGA_GAIN</name>
	<description>Select the PGA gain select:
0: -12 dB
1: -6 dB
2: 0 dB
3: 6 dB
4: 12 dB
5: 18 dB
6: 24 dB
7: 30 dB</description>
	<bitRange>[11:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PGA_SINGLE</name>
	<description>Use PGA in single ended mode
0: Differential mode (default)
1: Use N-branch as single ended mode
2: Use P-branch as single ended mode
3: Reserved (do not use)</description>
	<bitRange>[8:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PGA_MUTE</name>
	<description>Mute the PGA output
0: Unmuted (default)
1: Mute</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PGA_BIAS</name>
	<description>Configure the PGA bias control:
0: 0.40 x Ibias
1: 0.44 x Ibias
2: 0.50 x Ibias
3: 0.57 x Ibias
4: 0.66 x Ibias
5: 0.80 x Ibias
6: 1.00 x Ibias
7: 1.33 x Ibias</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PGA_SHORTIN</name>
	<description>PGA input short
0: Normal mode (default)
1: Short PGA inputs</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PGA_EN</name>
	<description>PGA enable:
00: both branches of PGA disabled
01: Positive branch of PGA enabled, Negative branch disabled
10: Positive branch of PGA disabled, Negative branch enabled
11: Both branches of PGA enabled</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SDADC_RESULT_REG</name>
	<description>Sigma Delta ADC Result Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SDADC_VAL</name>
	<description>Returns up to 16 bits linear value of the last AD conversion. The effective resolution depends on the OSR used.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SPI</name>
	<version>1.0</version>
	<description>SPI registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50020200</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>48</size>
	<usage>registers</usage>
</addressBlock>

