honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1459x/toolbox_resources/common/DA1459x-00.xml
	<registers>
	<register>
	<name>WATCHDOG_CTRL_REG</name>
	<description>Watchdog control register.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000006</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WRITE_BUSY</name>
	<description>0 = A new WATCHDOG_REG[WDOG_VAL] can be written.
1 = No new WATCHDOG_REG[WDOG_VAL] can be written.
Note: It takes some time before the programmed WDOG_VAL is updated in the (independent) Watchdog timer. During this time it is not possible to write a new value to WATCHDOG_REG[WDOG_VAL].</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>WDOG_FREEZE_EN</name>
	<description>0 = Watchdog timer can not be frozen when NMI_RST = 0.
1 = Watchdog timer can be frozen/resumed using
SET_FREEZE_REG[FRZ_WDOG]/
RESET_FREEZE_REG[FRZ_WDOG] when NMI_RST = 0.
Note: Although this bit is retained during sleep, the SET_FREEZE_REG[FRZ_SYS_WDOG] is not, so the watchdog cannot be frozen during CM33 sleep.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>NMI_RST</name>
	<description>0 = Watchdog timer generates NMI at value 0, and WDOG (SYS) reset at &lt;= -16. Timer can be frozen/resumed using
SET_FREEZE_REG[FRZ_WDOG]/
RESET_FREEZE_REG[FRZ_WDOG].
1 = Watchdog timer generates a WDOG (SYS) reset at value 0 and can not be frozen by software.
Note that this bit can only be set to 1 by software and only be reset with a WDOG (SYS) reset or software reset.
The watchdog is always frozen when the Cortex-M33 is halted in DEBUG State. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WATCHDOG_REG</name>
	<description>Watchdog timer register.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001fff</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WDOG_WEN</name>
	<description>Bit [31:14] = 0 = Write enable for Watchdog timer
Else, Write disable. This filter prevents unintentional presetting the watchdog with a software run-away. </description>
	<bitRange>[31:14]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>WDOG_VAL_NEG</name>
	<description>0 = Watchdog timer value is positive.
1 = Watchdog timer value is negative. </description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WDOG_VAL</name>
	<description>Write: Watchdog timer reload value. Note that all bits [31-14] must be 0 to reload this register.
Read: Actual Watchdog timer value. Decremented by 1 every ~10 ms (RCLP) or ~21 ms (RCX), that is the Watchdog timer clock tick.
Bit 13 indicates a negative counter value. 2, 1, 0, 3FFF16, 3FFE16 and so forth. An NMI or WDOG (SYS) reset is generated under the following conditions:
If WATCHDOG_CTRL_REG[NMI_RST] = 0 then
  If WDOG_VAL = 0 -&gt; NMI (Non Maskable Interrupt)
  if WDOG_VAL =3FF016 -&gt; WDOG reset -&gt; reload 1FFF16
If WATCHDOG_CTRL_REG[NMI_RST] = 1 then
  if WDOG_VAL &lt;= 0 -&gt; WDOG reset -&gt; reload 1FFF16
Note 1: The programmed value WDOG_VAL is updated in the (independent) Watchdog timer at the second next RCLP or RCX clock tick.
Note 2: Select RCLP (32 kHz) or RCX (15 kHz) with CLK_RCX_REG[RCX_ENABLE] for the Watchdog clock. The RCLP is selected by default. See for more info the description of CLK_RCX_REG[RCX_ENABLE].
Note 3: If WATCHDOG_CTRL_REG[NMI_RST] = 0, the time between the NMI generation and the WDOG reset generation is 15 Watchdog timer clock ticks.
Note 4: The internal Watchdog timer clock tick is the Watchdog clock divided by a fixed value of 320. </description>
	<bitRange>[12:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SYSB</name>
	<version>1.0</version>
	<description>SYSB registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50060400</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>12</size>
	<usage>registers</usage>
</addressBlock>

	<registers>
	<register>
	<name>BRIDGE_REG</name>
	<description>H2H CMAC Synchronization Register </description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>SYNC_BYPASS</name>
	<description>CMAC bridge, internal synchronization stages are bypassed.
0: Disabled
1: Enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BRIDGE_BYPASS</name>
	<description>CMAC bridge is bypassed only allowed when cmac hclk equals system hclk
0: Disabled
1: Enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>FLASH_ARB_REG</name>
	<description>FPU/ICM_S2 Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>ENABLE_SEQ</name>
	<description>Arbitration flash memory
0: Arbitration is carried out on every transfer
1: Arbitration is carried out at the beginning of every burst transfer</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>QSPI_ARB_REG</name>
	<description>ICM_S1 Priorities Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000e4</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>AHB_DMA_PRIO</name>
	<description>Priority AHB_DMA layer system bus
0x0: Highest priority
0x1: Second priority
0x2: Third priority
0x3: Fourth priority</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AHB_CPUC_PRIO</name>
	<description>Priority AHB_CPUC layer system bus
0x0: Highest priority
0x1: Second priority
0x2: Third priority
0x3: Fourth priority</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AHB_CPUS_PRIO</name>
	<description>Priority AHB_CPUS layer system bus
0x0: Highest priority
0x1: Second priority
0x2: Third priority
0x3: Fourth priority</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AHB_CMAC_PRIO</name>
	<description>Priority AHB_CMAC layer system bus
0x0: Highest priority
0x1: Second priority
0x2: Third priority
0x3: Fourth priority</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>TIMER</name>
	<version>1.0</version>
	<description>TIMER registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50010300</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>76</size>
	<usage>registers</usage>
</addressBlock>

